<a href="https://colab.research.google.com/github/buzaev-fedor/project-from-ml-course/blob/master/HW_%E2%84%963.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Домашнее задание №3

В этом домашнем задании нам нужно закрепить основы SQL.

In [ ]:
# установить библиотеку для подключения
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/d1/53/4cf90d2fe81b9cdb55dc180951bcec44ea8685665f1bdb1412501dc362dd/mysql_connector_python-8.0.20-cp36-cp36m-manylinux1_x86_64.whl (14.8MB)
     |████████████████████████████████| 14.8MB 306kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.10.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (46.3.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.20

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

## Бонусный туториал вне занятия

Вы можете выполнять задания с помощью кода как на занятии, через mysql.connector. Алтернативно можно добавлять значения в таблицу и читать их с помощью связки через sqlalchemy. Разницы в реализации особо нет (cм код ниже), но через pandas взаимодействие немного удобнее, не нужно создавать сложные запросы с кортежами.

Ниже представлен небольшой туториал по созданию подключения (ВАЖНО заменить в нем логины пароли таблицы на свой номер!), выгрузки элементов, добавлению одного элемента в результат и загрузки результатов обратно в таблицу (все средствами pandas).

In [ ]:
# импортируем библиотеку
from sqlalchemy import create_engine

In [ ]:
# создаем объект подключения

### !!!! Замените Х на соответсвующий вашему в таблице
# https://docs.google.com/spreadsheets/d/1052tb8DJiER2Fj3U-b1kUvFhIf5WE440r_9aqAs-VRY/edit?usp=sharing
sql = create_engine('mysql+mysqlconnector://user23:userpassword23@157.230.109.1/classicmodels_user23', pool_recycle=60)
connection = sql.connect()
# отправка комманд без чтения/записи (например удаление) в самом конце

In [ ]:
# отобразим доступные таблицы
pd.read_sql('Show tables;', connection)

   Tables_in_classicmodels_user23
0                       customers
1                       employees
2                         offices
3                    orderdetails
4                          orders
5                            ords
6                        payments
7                          people
8                    productlines
9                        products
10                   salePerOrder
11                  subscriptions
12                      suppliers
13                          users
14                       vehicles

In [ ]:
# отобразим таблицу customers
df = pd.read_sql('Select * from customers', connection)
# посмотрим на последние 5 значений
df.tail()

     customerNumber  ... creditLimit
117             486  ...     72600.0
118             487  ...     60300.0
119             489  ...     43300.0
120             495  ...     85100.0
121             496  ...    110000.0

[5 rows x 13 columns]

In [ ]:
# возьмем последнюю строку
sample_string = df.iloc[len(df)-1]
# cкопируем последнюю строку и изменим номер (т.к. иначе возникнет ошибка из-за первичного ключа)
sample_string['customerNumber'] = 497
sample_string

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

customerNumber                           497
customerName               Kelly's Gift Shop
contactLastName                      Snowden
contactFirstName                        Tony
phone                          +64 9 5555500
addressLine1              Arenales 1938 3'A'
addressLine2                            None
city                              Auckland
state                                   None
postalCode                              None
country                          New Zealand
salesRepEmployeeNumber                  1612
creditLimit                           110000
Name: 121, dtype: object

In [ ]:
# добавим в конец элемент
df.loc[len(df)] = list(sample_string)
# отобразим изменения, создан дубль последней
df.tail()

     customerNumber  ... creditLimit
118             487  ...     60300.0
119             489  ...     43300.0
120             495  ...     85100.0
121             496  ...    110000.0
122             497  ...    110000.0

[5 rows x 13 columns]

In [ ]:
# сохраним изменения в sql

# index=False для игнорирования столбца индексов как колонки
# [122:] и if_exists='append' для добавления новых элементов (иначе получим ошибку Cannot delete or update a parent row: a foreign key constraint fails)
# 'customers' указывает на название таблицы, в которую добавим строки
# объект connection на подключение
df[122:].to_sql('customers', connection, if_exists='append', index=False)

In [ ]:
# отправим запрос на подтверждение результата
df = pd.read_sql('Select * from customers', connection)
df.tail()

     customerNumber  ... creditLimit
118             487  ...     60300.0
119             489  ...     43300.0
120             495  ...     85100.0
121             496  ...    110000.0
122             497  ...    110000.0

[5 rows x 13 columns]

In [ ]:
# удалим тестовую строку
# альтернативно все считывание можно проводить по аналогии
connection.execute("DELETE FROM customers WHERE customerNumber=497;")

In [ ]:
# отправим запрос на подтверждение результата
df = pd.read_sql('Select * from customers', connection)
df.tail()

     customerNumber  ... creditLimit
117             486  ...     72600.0
118             487  ...     60300.0
119             489  ...     43300.0
120             495  ...     85100.0
121             496  ...    110000.0

[5 rows x 13 columns]

Можно реализовывать задание как на занятии:

In [ ]:
# инициализировать коннектор для удаленного подключения с указанными параетрами
# cursor = conn.cursor(buffered=True)

# conn = mysql.connector.connect(user='user1',
#                               password='userpassword1',
#                               host='157.230.109.1',
#                               database='classicmodels_user1')

# Ваше задание

Работаем с БД с урока:

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

##Задача №1 (1 балл)

Найти номер клиента и количество его заказов (таблица orders) по убыванию 

Подсказка: 

Order by название_столбца_по_которому_убываем desc;

In [ ]:
df = pd.read_sql('''

SELECT 
    customerNumber as 'Номер клиента', 
    COUNT(orderNumber) as 'количество заказов'
FROM 
    orders
GROUP BY customerNumber
ORDER BY COUNT(orderNumber) DESC

''', connection)
df.head(10)

   Номер клиента  количество заказов
0            141                  26
1            124                  17
2            148                   5
3            114                   5
4            353                   5
5            323                   5
6            145                   5
7            151                   4
8            157                   4
9            276                   4

##Задача №2 (2 балла)

Создать запрос с полями и вывести первые 10 значений

Название колонки | Источник иформации
--- | ---
Работник | конкатенация колонок firstName lastName таблицы employees
Почта | столбец email таблицы employees
Название работы | столбец job title таблицы employees
Адрес работы |  конкатенация колонок postalCode, addressLine1, state, country таблицы offices
Телефон офиса |  столбец phone таблицы offices

In [ ]:
df = pd.read_sql('''
SELECT CONCAT(e.firstName,' ',e.lastName) 'Работник', e.email as 'Почта', e.jobTitle as 'Должность', 
        CONCAT(o.postalCode,' ',addressLine1,' ', state,' ',country) 'Адрес работы', 
        o.phone as 'Телефон'
FROM
    employees e
LEFT JOIN
    offices o
ON e.officeCode = o.officeCode
''', connection)
df.head(10)

            Работник  ...          Телефон
0       Diane Murphy  ...  +1 650 219 4782
1     Mary Patterson  ...  +1 650 219 4782
2      Jeff Firrelli  ...  +1 650 219 4782
3  William Patterson  ...  +61 2 9264 2451
4      Gerard Bondur  ...  +33 14 723 4404
5        Anthony Bow  ...  +1 650 219 4782
6    Leslie Jennings  ...  +1 650 219 4782
7    Leslie Thompson  ...  +1 650 219 4782
8     Julie Firrelli  ...  +1 215 837 0825
9    Steve Patterson  ...  +1 215 837 0825

[10 rows x 5 columns]

##Задача № 3 (2 балла)

Отобразить название продукта и текстовое описание продуктовой линии (таблицы products и productlines)

In [ ]:
df = pd.read_sql('''

SELECT 
    p.productName as 'Название продукта', 
    pl.textDescription as 'Описание продуктовой линии'
FROM   
    products p
LEFT JOIN 
    productlines pl
ON 
    p.productLine = pl.productLine

''', connection)
df.head(10)

                       Название продукта                         Описание продуктовой линии
0  1969 Harley Davidson Ultimate Chopper  Our motorcycles are state of the art replicas ...
1               1952 Alpine Renault 1300  Attention car enthusiasts: Make your wildest c...
2                  1996 Moto Guzzi 1100i  Our motorcycles are state of the art replicas ...
3   2003 Harley-Davidson Eagle Drag Bike  Our motorcycles are state of the art replicas ...
4                    1972 Alfa Romeo GTA  Attention car enthusiasts: Make your wildest c...
5                 1962 LanciaA Delta 16V  Attention car enthusiasts: Make your wildest c...
6                      1968 Ford Mustang  Attention car enthusiasts: Make your wildest c...
7                      2001 Ferrari Enzo  Attention car enthusiasts: Make your wildest c...
8                         1958 Setra Bus  The Truck and Bus models are realistic replica...
9                       2002 Suzuki XREO  Our motorcycles are state of the art replicas ...

##Задача № 4 (2 балла)

Создать запрос с полями:

Название колонки | Источник иформации
--- | ---
Номер заказа | столбец orderNumber таблицы orders
Номер клиента | столбец customerNumber таблицы orders
Требуемая дата доставки | столбец requiredDate таблицы orders
Дата доставки | столбец shippedDate таблицы orders
Статус доставки | столбец status таблицы orders
Кредитный лимит | столбец creditLimit таблицы customers
Сумма оплаты | столбец amount таблицы payments
Дата совершения оплаты | столбец paymentDate таблицы payments

Отобразить первые 10 строк.

Примечание:

Результаты запроса SELECT можно сохранить для последющего использования

`
    SELECT
        my_select.some_column
    FROM
    (SELECT ...) as my_select
`

In [ ]:
df = pd.read_sql('''

SELECT o.orderNumber as 'Номер заказа', o.customerNumber as 'Номер клиента',
        o.requiredDate as 'Требуемая дата доставки', 
        o.shippedDate as 'Дата доставки', o.status as 'Статус доставки',
        c.creditLimit as 'Кредитный лимит', p.amount as 'Сумма оплаты',
        p.paymentDate as 'Дата совершения оплаты'
FROM orders o
LEFT JOIN
    customers c
ON 
    o.customerNumber = c.customerNumber
LEFT JOIN
    payments p
ON 
    o.customerNumber = p.customerNumber
;
''', connection)
df.head(10)

   Номер заказа  Номер клиента  ... Сумма оплаты Дата совершения оплаты
0         10100            363  ...     50799.69             2004-11-17
1         10100            363  ...     10223.83             2003-01-16
2         10100            363  ...     55425.77             2003-12-05
3         10101            128  ...     10549.01             2003-01-28
4         10101            128  ...     24101.81             2003-10-18
5         10101            128  ...     33820.62             2004-03-24
6         10101            128  ...      7466.32             2004-11-18
7         10102            181  ...     22602.36             2004-04-25
8         10102            181  ...      5494.78             2003-01-30
9         10102            181  ...     44400.50             2004-11-16

[10 rows x 8 columns]

##Задача № 5 (3 балла)

Создать представление с полями:

Название колонки | Источник иформации
--- | ---
Номер заказа | столбец orderNumber таблицы orders
Название продукта | столбец productName таблицы products
Код продукта | столбец productCode таблицы products
Количество заказов | столбец quantityOrdered таблицы orderdetails
Цена за один | столбец priceEach таблицы orderdetails
Цена покупки | столбец buyPrice таблицы products
Итоговая сумма | результат перемножения цены покупки * кол-во заказанных
Прибыль | результат перемножения (закупочной цены (buy Price из products) минус цена покупки) * кол-во заказанных
Заказчик | столбец customerName таблицы customers
Имя представителя | конкатенация столбцев contactLastName и contactFirstName таблицы customers
адрес | столбец addressLine1 таблицы customers

Отобразить результат вызвав представления

Из полученного представления найти заказчиков и принесенную прибыль, (отсортировать по убыванию суммарной прибыли по всем), отобразить

In [ ]:
connection.execute('''
DROP VIEW ords
''')

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 0))

ProgrammingError: ignored

In [ ]:
connection.execute('''

CREATE VIEW ords AS 
    SELECT
        o.orderNumber as 'Номер заказа', p.productName as 'Название продукта',
        p.productCode as 'Код продукта', od.quantityOrdered as 'Количество заказов',
        od.priceEach as 'Цена за один', p.buyPrice as 'Цена покупки',
        od.priceEach * od.quantityOrdered as 'Итоговая сумма',
        (od.priceEach * od.quantityOrdered) - (p.buyPrice * od.quantityOrdered) as 'Прибыль',
        c.customerName as 'Заказчик', CONCAT(c.contactLastName,' ',c.contactFirstName) 'Имя представителя',
        c.addressLine1 as 'Адрес'
    FROM 
        orders o
    LEFT JOIN
        orderdetails od
    ON
        o.orderNumber = od.orderNumber
    LEFT JOIN
        products p
    ON
        od.productCode = p.productCode
    LEFT JOIN
        customers c
    ON
        o.customerNumber = c.customerNumber

''')

In [ ]:
# отправим запрос на подтверждение результата
df = pd.read_sql('''
SELECT * from ords''', connection)
df.head(10)

   Номер заказа  ...            Адрес
0         10123  ...   54, rue Royale
1         10123  ...   54, rue Royale
2         10123  ...   54, rue Royale
3         10123  ...   54, rue Royale
4         10298  ...   54, rue Royale
5         10298  ...   54, rue Royale
6         10345  ...   54, rue Royale
7         10124  ...  8489 Strong St.
8         10124  ...  8489 Strong St.
9         10124  ...  8489 Strong St.

[10 rows x 11 columns]

Из полученного представления найти заказчиков и принесенную прибыль, (отсортировать по убыванию суммарной прибыли по всем)

In [ ]:
df = pd.read_sql('''

SELECT Заказчик, SUM(Прибыль) as 'Суммарная прибыль'
FROM 
    ords
GROUP BY Заказчик
ORDER BY SUM(Прибыль) DESC
;''', connection)
df.head(10)

                       Заказчик  Суммарная прибыль
0        Euro+ Shopping Channel          326519.66
1  Mini Gifts Distributors Ltd.          236769.39
2            Muscle Machine Inc           72370.09
3    Australian Collectors, Co.           70311.07
4             La Rochelle Gifts           60875.30
5       Dragon Souveniers, Ltd.           60477.38
6                AV Stores, Co.           60095.86
7    Down Under Souveniers, Inc           60013.99
8             Land of Toys Inc.           58669.10
9     The Sharp Gifts Warehouse           55931.37

In [ ]:
# отправим запрос на подтверждение результата
df = pd.read_sql('''

# ваш запрос к представлению

''', connection)
df.head(10)

                       Заказчик  Суммарная прибыль
0        Euro+ Shopping Channel          263439.51
1  Mini Gifts Distributors Ltd.          232494.29
2            Muscle Machine Inc           72370.09
3    Australian Collectors, Co.           70311.07
4       Dragon Souveniers, Ltd.           60477.38
5                AV Stores, Co.           60095.86
6    Down Under Souveniers, Inc           60013.99
7      Corporate Gift Ideas Co.           55674.28
8         Salzburg Collectables           54724.68
9       Anna's Decorations, Ltd           54551.66